app/controllers/producers_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."producer_id" = $1  ORDER BY "tracks"."id" ASC LIMIT 1  [["producer_id", 8]]
---
  def index
    @tracks = Producer.find(params[:id]).tracks