app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @tracks = Track.all

INSERT INTO "tracks" ("title", "bpm", "thumb_img", "audio_url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Boom"], ["bpm", "85.0"], ["thumb_img", ""], ["audio_url", ""], ["price", "50.0"], ["created_at", "2016-01-18 18:51:19.828321"], ["updated_at", "2016-01-18 18:51:19.828321"]]
---
  def create
    track_params = params.require(:track).permit(:title, :bpm, :thumb_img, :audio_url, :price, :time)
    @track = Track.new(track_params)
    @track.user = current_user
    @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "tracks" SET "thumb_img" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["thumb_img", "https://drive.google.com/file/d/0BxXY7hL62LPlbTcwa0RJZWhQSkE/view"], ["updated_at", "2016-01-19 21:34:22.221163"], ["id", 7]]
---
  def update
    @track = Track.find(params[:id])
    @track.update_attributes(params.require(:track).permit(:title, :bpm, :thumb_img, :audio_url, :price, :time))

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 3]]
---
  def destroy
    track = Track.find(params[:id])
    track.destroy